import java.nio.file.FileSystems;
import java.nio.file.Path;

public class Constants {

    public static final Path CURRENT_WORKING_DIRECTORY = FileSystems.getDefault().getPath("").toAbsolutePath();

    public static final String DATA_FILE_PATH = CURRENT_WORKING_DIRECTORY + "/resources/Greece.csv";

    public static final String[] DATA_FILE_HEADERS = {
        "ΈΤΟΣ",
        "1. ΈΣΟΔΑ ΣΥΝΟΛΟ",
        "11. Φόροι",
        "12. Κοινωνικές εισφορές",
        "13. Μεταβιβάσεις (έσοδα)",
        "14. Πωλήσεις αγαθών και υπηρεσιών",
        "15. Λοιπά τρέχοντα έσοδα",
        "31. Πάγια περιουσιακά στοιχεία (έσοδα)",
        "43. Χρεωστικοί τίτλοι",
        "45. Συμμετοχές και επενδύσεις (έσοδα)",
        "52. Υποχρεώσεις από καταθέσεις και νομίσματα",
        "53. Χρεωστικοί τίτλοι (υποχρεώσεις - έσοδα)",
        "54. Δάνεια (έσοδα)",
        "2. ΈΞΟΔΑ ΣΥΝΟΛΟ",
        "21. Παροχές εργαζομένων",
        "22. Κοινωνικές παροχές",
        "23. Μεταβιβάσεις (έξοδα)",
        "24. Αγορές αγαθών και υπηρεσιών",
        "25. Επιχορηγήσεις -Επιδοτήσεις",
        "26. Τόκοι",
        "27. Λοιπά έξοδα",
        "29. Πιστώσεις υπό κατανομή",
        "31. Πάγια περιουσιακά στοιχεία (έξοδα)",
        "33. Τιμαλφή περιουσία",
        "44. Δάνεια κωδικού 44 (έξοδα)",
        "45. Συμμετοχές και επενδύσεις (έξοδα)",
        "53. Χρεωστικοί τίτλοι (υποχρεώσεις - έξοδα)",
        "54. Δάνεια (έξοδα)",
        "57. Χρηματοοικονομικά παράγωγα"
    };

    public static final int HEADERS_SPLIT_POINT = 13;

    public static final String COMMA_DELIMITER = ",";
        
}
