<<<<<<< HEAD
import java.awt.Dimension;
import java.awt.Toolkit;
=======
>>>>>>> main
import java.nio.file.FileSystems;
import java.nio.file.Path;

public class Constants {

<<<<<<< HEAD
    // data file/dir constants
    public static final String FILE_NAME_IN_RESOURCES = "/resources/Greece.csv";

    public static final Path CURRENT_WORKING_DIRECTORY = FileSystems.getDefault().getPath("").toAbsolutePath();

    public static final String DATA_FILE_PATH = CURRENT_WORKING_DIRECTORY + FILE_NAME_IN_RESOURCES;

    // array data constants
=======
    public static final Path CURRENT_WORKING_DIRECTORY = FileSystems.getDefault().getPath("").toAbsolutePath();

    public static final String DATA_FILE_PATH = CURRENT_WORKING_DIRECTORY + "/resources/Greece.csv";

>>>>>>> main
    public static final String[] DATA_FILE_HEADERS = {
        "ΈΤΟΣ",
        "1. ΈΣΟΔΑ ΣΥΝΟΛΟ",
        "11. Φόροι",
        "12. Κοινωνικές εισφορές",
        "13. Μεταβιβάσεις (έσοδα)",
        "14. Πωλήσεις αγαθών και υπηρεσιών",
        "15. Λοιπά τρέχοντα έσοδα",
        "31. Πάγια περιουσιακά στοιχεία (έσοδα)",
        "43. Χρεωστικοί τίτλοι",
        "45. Συμμετοχές και επενδύσεις (έσοδα)",
        "52. Υποχρεώσεις από καταθέσεις και νομίσματα",
        "53. Χρεωστικοί τίτλοι (υποχρεώσεις - έσοδα)",
        "54. Δάνεια (έσοδα)",
        "2. ΈΞΟΔΑ ΣΥΝΟΛΟ",
        "21. Παροχές εργαζομένων",
        "22. Κοινωνικές παροχές",
        "23. Μεταβιβάσεις (έξοδα)",
        "24. Αγορές αγαθών και υπηρεσιών",
        "25. Επιχορηγήσεις -Επιδοτήσεις",
        "26. Τόκοι",
        "27. Λοιπά έξοδα",
        "29. Πιστώσεις υπό κατανομή",
        "31. Πάγια περιουσιακά στοιχεία (έξοδα)",
        "33. Τιμαλφή περιουσία",
        "44. Δάνεια κωδικού 44 (έξοδα)",
        "45. Συμμετοχές και επενδύσεις (έξοδα)",
        "53. Χρεωστικοί τίτλοι (υποχρεώσεις - έξοδα)",
        "54. Δάνεια (έξοδα)",
        "57. Χρηματοοικονομικά παράγωγα",
<<<<<<< HEAD
        "ΑΠΟΤΕΛΕΣΜΑ ΚΡΑΤΙΚΟΥ ΠΡΟΫΠΟΛΟΓΙΣΜΟΥ (ΕΣΟΔΑ-ΕΞΟΔΑ)",
=======
>>>>>>> main
        "1001. Προεδρία της Δημοκρατίας",
        "1001. Προεδρία της Δημοκρατίας",
        "1001. Προεδρία της Δημοκρατίας",
        "1002. Βουλή των Ελλήνων",
        "1002. Βουλή των Ελλήνων",
        "1002. Βουλή των Ελλήνων",
        "1003. Υπουργικό Συμβούλιο",
        "1003. Υπουργικό Συμβούλιο",
        "1003. Υπουργικό Συμβούλιο",
        "ΥΠΟΥΡΓΕΙΑ",
        "ΥΠΟΥΡΓΕΙΑ",
        "ΥΠΟΥΡΓΕΙΑ",
        "1007. Υπουργείο Εσωτερικών",
        "1007. Υπουργείο Εσωτερικών",
        "1007. Υπουργείο Εσωτερικών",
        "1009. Υπουργείο Εξωτερικών",
        "1009. Υπουργείο Εξωτερικών",
        "1009. Υπουργείο Εξωτερικών",
        "1011. Υπουργείο Εθνικής Άμυνας",
        "1011. Υπουργείο Εθνικής Άμυνας",
        "1011. Υπουργείο Εθνικής Άμυνας",
        "1015. Υπουργείο Υγείας",
        "1015. Υπουργείο Υγείας",
        "1015. Υπουργείο Υγείας",
        "1017. Υπουργείο Δικαιοσύνης",
        "1017. Υπουργείο Δικαιοσύνης",
        "1017. Υπουργείο Δικαιοσύνης",
        "1019. Υπουργείο Παιδείας και Θρησκευμάτων",
        "1019. Υπουργείο Παιδείας και Θρησκευμάτων",
        "1019. Υπουργείο Παιδείας και Θρησκευμάτων",
        "1021. Υπουργείο Πολιτισμού και Αθλητισμού",
        "1021. Υπουργείο Πολιτισμού και Αθλητισμού",
        "1021. Υπουργείο Πολιτισμού και Αθλητισμού",
        "1023. Υπουργείο Οικονομικών",
        "1023. Υπουργείο Οικονομικών",
        "1023. Υπουργείο Οικονομικών",
        "1029. Υπουργείο Αγροτικής Ανάπτυξης και Τροφίμων",
        "1029. Υπουργείο Αγροτικής Ανάπτυξης και Τροφίμων",
        "1029. Υπουργείο Αγροτικής Ανάπτυξης και Τροφίμων",
        "1031. Υπουργείο Περιβάλλοντος και Ενέργειας",
        "1031. Υπουργείο Περιβάλλοντος και Ενέργειας",
        "1031. Υπουργείο Περιβάλλοντος και Ενέργειας",
        "1033. Υπουργείο Εργασίας και Κοινωνικών Υποθέσεων",
        "1033. Υπουργείο Εργασίας και Κοινωνικών Υποθέσεων",
        "1033. Υπουργείο Εργασίας και Κοινωνικών Υποθέσεων",
        "1035. Υπουργείο Ανάπτυξης και Επενδύσεων",
        "1035. Υπουργείο Ανάπτυξης και Επενδύσεων",
        "1035. Υπουργείο Ανάπτυξης και Επενδύσεων",
        "1039. Υπουργείο Υποδομών και Μεταφορών",
        "1039. Υπουργείο Υποδομών και Μεταφορών",
        "1039. Υπουργείο Υποδομών και Μεταφορών",
        "1041. Υπουργείο Ναυτιλίας και Νησιωτικής Πολιτικής",
        "1041. Υπουργείο Ναυτιλίας και Νησιωτικής Πολιτικής",
        "1041. Υπουργείο Ναυτιλίας και Νησιωτικής Πολιτικής",
        "1045. Υπουργείο Τουρισμού",
        "1045. Υπουργείο Τουρισμού",
        "1045. Υπουργείο Τουρισμού",
        "1053. Υπουργείο Ψηφιακής Διακυβέρνησης",
        "1053. Υπουργείο Ψηφιακής Διακυβέρνησης",
        "1053. Υπουργείο Ψηφιακής Διακυβέρνησης",
        "1055. Υπουργείο Μετανάστευσης και Ασύλου",
        "1055. Υπουργείο Μετανάστευσης και Ασύλου",
        "1055. Υπουργείο Μετανάστευσης και Ασύλου",
        "1057. Υπουργείο Προστασίας του Πολίτη",
        "1057. Υπουργείο Προστασίας του Πολίτη",
        "1057. Υπουργείο Προστασίας του Πολίτη",
        "1059. Υπουργείο Κλιματικής Κρίσης και Πολιτικής Προστασίας",
        "1059. Υπουργείο Κλιματικής Κρίσης και Πολιτικής Προστασίας",
        "1059. Υπουργείο Κλιματικής Κρίσης και Πολιτικής Προστασίας",
        "ΑΠΟΚΕΝΤΡΩΜΕΝΕΣ ΔΙΟΙΚΗΣΕΙΣ",
        "ΑΠΟΚΕΝΤΡΩΜΕΝΕΣ ΔΙΟΙΚΗΣΕΙΣ",
        "ΑΠΟΚΕΝΤΡΩΜΕΝΕΣ ΔΙΟΙΚΗΣΕΙΣ",
        "1901. Αποκεντρωμένη Διοίκηση Αττικής",
        "1901. Αποκεντρωμένη Διοίκηση Αττικής",
        "1901. Αποκεντρωμένη Διοίκηση Αττικής",
        "1902. Αποκεντρωμένη Διοίκηση Θεσσαλίας - Στερεάς Ελλάδας",
        "1902. Αποκεντρωμένη Διοίκηση Θεσσαλίας - Στερεάς Ελλάδας",
        "1902. Αποκεντρωμένη Διοίκηση Θεσσαλίας - Στερεάς Ελλάδας",
        "1903. Αποκεντρωμένη Διοίκηση Ηπείρου - Δυτικής Μακεδονίας",
        "1903. Αποκεντρωμένη Διοίκηση Ηπείρου - Δυτικής Μακεδονίας",
        "1903. Αποκεντρωμένη Διοίκηση Ηπείρου - Δυτικής Μακεδονίας",
        "1904. Αποκεντρωμένη Διοίκηση Πελοποννήσου - Δυτικής Ελλάδας & Ιονίου",
        "1904. Αποκεντρωμένη Διοίκηση Πελοποννήσου - Δυτικής Ελλάδας & Ιονίου",
        "1904. Αποκεντρωμένη Διοίκηση Πελοποννήσου - Δυτικής Ελλάδας & Ιονίου",
        "1905. Αποκεντρωμένη Διοίκηση Αιγαίου",
        "1905. Αποκεντρωμένη Διοίκηση Αιγαίου",
        "1905. Αποκεντρωμένη Διοίκηση Αιγαίου",
        "1906. Αποκεντρωμένη Διοίκηση Κρήτης",
        "1906. Αποκεντρωμένη Διοίκηση Κρήτης",
        "1906. Αποκεντρωμένη Διοίκηση Κρήτης",
        "1907. Αποκεντρωμένη Διοίκηση Μακεδονίας - Θράκης",
        "1907. Αποκεντρωμένη Διοίκηση Μακεδονίας - Θράκης",
        "1907. Αποκεντρωμένη Διοίκηση Μακεδονίας - Θράκης",
        "ΣΥΝΟΛΟ ΕΞΟΔΩΝ ΚΡΑΤΙΚΟΥ ΠΡΟΫΠΟΛΟΓΙΣΜΟΥ",
        "ΣΥΝΟΛΟ ΕΞΟΔΩΝ ΚΡΑΤΙΚΟΥ ΠΡΟΫΠΟΛΟΓΙΣΜΟΥ",
        "ΣΥΝΟΛΟ ΕΞΟΔΩΝ ΚΡΑΤΙΚΟΥ ΠΡΟΫΠΟΛΟΓΙΣΜΟΥ"
    };

    // building point constants
    public static final int BO_LEFT_PANEL_START = 1;
    public static final int BO_RIGHT_PANEL_START = 13;
<<<<<<< HEAD
    public static final int BO_BOTTOM_PANEL_START = 29;
    public static final int BD_NESTED_PANEL1_START = 30;
    public static final int BD_NESTED_PANEL2_START = 39;
    public static final int BD_NESTED_PANEL3_START = 99;
    public static final int BD_BOTTOM_PANEL_START = 123;
=======
    public static final int BD_NESTED_PANEL1_START = 29;
    public static final int BD_NESTED_PANEL2_START = 38;
    public static final int BD_NESTED_PANEL3_START = 98;
>>>>>>> main
    public static final int ENDING_POINT = DATA_FILE_HEADERS.length;

    // delimiter constants
    public static final String COMMA_DELIMITER = ",";
    
    // window building dimension constants
    public static final Dimension SCREEN_SIZE = Toolkit.getDefaultToolkit().getScreenSize();
    public static final Double SCREEN_WIDTH = SCREEN_SIZE.getWidth();
    public static final Double SCREEN_HEIGHT = SCREEN_SIZE.getHeight() * 0.9;
    public static final int FRAME_WIDTH = SCREEN_WIDTH.intValue();
    public static final int FRAME_HEIGHT = SCREEN_HEIGHT.intValue();
}
